## [ Excel -> DataFrame 저장 ]

(1) 모듈 로딩 <hr>

In [1]:
import pandas as pd

(2) 데이터 준비 <hr>

In [2]:
file1 = '../../DATA/Single Worksheet.xlsx'
file2 = '../../DATA/Multiple Worksheets.xlsx'

In [3]:
pd.read_excel(file1)

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [4]:
pd.read_excel(file2, sheet_name=2)

  First Name  Last Name     City Gender
0     Robert     Miller  Seattle      M
1       Tara     Garcia  Phoenix      F
2    Raphael  Rodriguez  Orlando      M

In [5]:
pd.read_excel(file2, sheet_name='Data 3')

  First Name  Last Name     City Gender
0     Robert     Miller  Seattle      M
1       Tara     Garcia  Phoenix      F
2    Raphael  Rodriguez  Orlando      M

In [25]:
# sheet_name = None 적용하면 모든 시트를 읽어들인다.
# 딕셔너리를 반환한다. (키:값(df))
dataDict = pd.read_excel(file2, sheet_name=None)
dataDict

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F,
 'Data 3':   First Name  Last Name     City Gender
 0     Robert     Miller  Seattle      M
 1       Tara     Garcia  Phoenix      F
 2    Raphael  Rodriguez  Orlando      M}

## [ JSON -> DataFrame 저장 ]

(1) 데이터 준비 <hr>

In [7]:
file3 = '../../DATA/nobel.json'

(2) JSON -> DataFrame 으로 저장

In [8]:
nobelDF = pd.read_json(file3)
nobelDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 646 entries, 0 to 645
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   prizes  646 non-null    object
dtypes: object(1)
memory usage: 5.2+ KB

(3) 데이터 확인

print(nobelDF.head(3), nobelDF.tail(3), sep='\n\n')

(4) 데이터 추출

In [9]:
# 행 추출 => loc[] / iloc[]
type(nobelDF.iloc[0]), nobelDF.iloc[0]

(pandas.core.series.Series,
 prizes    {'year': '2019', 'category': 'chemistry', 'lau...
 Name: 0, dtype: object)

In [10]:
nobelDF.iloc[0]['prizes']

{'year': '2019',
 'category': 'chemistry',
 'laureates': [{'id': '976',
   'firstname': 'John',
   'surname': 'Goodenough',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '977',
   'firstname': 'M. Stanley',
   'surname': 'Whittingham',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '978',
   'firstname': 'Akira',
   'surname': 'Yoshino',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'}]}

In [11]:
oneData = nobelDF.iloc[0]['prizes']
oneData.keys(), oneData.items()

(dict_keys(['year', 'category', 'laureates']),
 dict_items([('year', '2019'), ('category', 'chemistry'), ('laureates', [{'id': '976', 'firstname': 'John', 'surname': 'Goodenough', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '977', 'firstname': 'M. Stanley', 'surname': 'Whittingham', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '978', 'firstname': 'Akira', 'surname': 'Yoshino', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}])]))

In [12]:
for k, v in oneData.items():
    print(f'[{k}]\n==>{v}')
    if k == 'laureates':
        for d in v:
            for k1, v1 in d.items():
                print("-", k1, v1)

[year]
==>2019
[category]
==>chemistry
[laureates]
==>[{'id': '976', 'firstname': 'John', 'surname': 'Goodenough', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '977', 'firstname': 'M. Stanley', 'surname': 'Whittingham', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '978', 'firstname': 'Akira', 'surname': 'Yoshino', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}]
- id 976
- firstname John
- surname Goodenough
- motivation "for the development of lithium-ion batteries"
- share 3
- id 977
- firstname M. Stanley
- surname Whittingham
- motivation "for the development of lithium-ion batteries"
- share 3
- id 978
- firstname Akira
- surname Yoshino
- motivation "for the development of lithium-ion batteries"
- share 3

-  json 중첩 데이터의 다중 반복문 -> 단일 리스트 형태 처리 : 평탄화 / 정규화

In [13]:
pd.json_normalize(oneData, record_path='laureates')

,id,firstname,surname,motivation,share
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3

In [14]:
pd.json_normalize(oneData, record_path='laureates', meta=['year', 'category'])

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3,2019,chemistry

* 모든 행에 대한 평탄화 작업 진행

In [15]:
# 컬럼 읽기 => DF객체변수명['컬럼명'], DF.객체변수명.컬럼명
# 모든 행에 record_path에 해당하는 키(key)가 존재해야 함!!
# 'laureates'가 존재하지 않는 행에 'laureates' 추가 (record_path에 해당하는 키 추가)
# pd.json_normalize(nobelDF.prizes, record_path='laureates')
for data in nobelDF.prizes:
    # print(type(data), data.keys(), end='\n\n')
    # 해당 dict에 laureates 키가 없다면 추가
    data.setdefault('laureates', [])

In [16]:
nobelDF2 = pd.json_normalize(nobelDF.prizes, record_path='laureates', meta=['year', 'category'])
nobelDF2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 950 entries, 0 to 949
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          950 non-null    object
 1   firstname   950 non-null    object
 2   surname     921 non-null    object
 3   motivation  950 non-null    object
 4   share       950 non-null    object
 5   year        950 non-null    object
 6   category    950 non-null    object
dtypes: object(7)
memory usage: 52.1+ KB

## 행 추출 => loc[[n1, ... ,]] / iloc[[n1, ... ,]]
nobelDF.iloc[4]
nobelDF.iloc[[0, 3]]

* (7) JSON의 다양한 방식의 DataFrame 저장하기 => orient 파라미터

In [17]:
# JSON 배열 : 파이썬 입장에서는 dict-like
json_data='''
[
{"id" : "1","name":"sravan","age":22},
{"id" : "2","name":"harsha","age":22},
{"id" : "3","name":"deepika","age":21},
{"id" : "4","name":"jyothika","age":23}
]
'''

- orient = 'record' 설정 => JSON 파일 데이터를 행 단위로 읽어서 DataFrame에 저장

In [18]:
df = pd.read_json(json_data, orient='records')
df

   id      name  age
0   1    sravan   22
1   2    harsha   22
2   3   deepika   21
3   4  jyothika   23

In [19]:
# 데이터 => 키 : 값
# 딕셔너리 값이 딕셔너리
json_data2 = '''
{
    "student-1" : {"id" : "1","name":"sravan","age":22},
    "student-2" : {"id" : "2","name":"harsha","age":22},
    "student-3" : {"id" : "3","name":"deepika","age":21},
    "student-4" : {"id" : "4","name":"jyothika","age":23}
}
'''

In [20]:
# 키 => 인덱스로 설정
df = pd.read_json(json_data2, orient='index')
df

           id      name  age
student-1   1    sravan   22
student-2   2    harsha   22
student-3   3   deepika   21
student-4   4  jyothika   23

In [21]:
# 키 => 인덱스로 설정
df = pd.read_json(json_data2).T
df

          id      name age
student-1  1    sravan  22
student-2  2    harsha  22
student-3  3   deepika  21
student-4  4  jyothika  23

In [22]:
df = pd.read_json(json_data2, orient='columns')
df

     student-1 student-2 student-3 student-4
id           1         2         3         4
name    sravan    harsha   deepika  jyothika
age         22        22        21        23

In [23]:
# JSON Format 
json_data3 = '''
[
    [ "1", "sravan",22 ],
    [ "2", "harsha",22 ],
    [ "3", "deepika",21 ],
    [ "4", "jyothika",23 ]
]
'''

In [24]:
df = pd.read_json(json_data3, orient='values')
df

   0         1   2
0  1    sravan  22
1  2    harsha  22
2  3   deepika  21
3  4  jyothika  23